// OR =================================================

//alert(true || 'No metter what')


//let x;
//false || (x = 1);
//alert(x);         // underined, เพราะว่า OR จะจบก่อนที่จะรับค่า x = 1  เนื่องจาก จะเจอ True และ OR เมื่อ เจอ True จะจบการทำงานทันทีไม่เช็คค่าต่อไป




// AND  ============================================================================
let x = 1;
console.log(x < 0) && alert(' Greater than zero ');   // log false
console.log(x > 0) && alert(' Greater than zero ');   // log true /// alert Greater than zero 
// and ( && ) ถ้าเจอ  true เงื่อนไขแรก จะ โชว์อันถัดไป จนกว่าจะเจอ false  และถ้าเจอ false จะโชว์ false ทันที 

// ** AND **  จะทำงานก่อน ** OR **


// ===============================================================================











