// let i = 0;
// while (i < 3) {
//     console.log(i);
//     i++;
// }
// 0 1 2


//=============================
// for (let i = 0; i < 3; i++) {
//     console.log(i);
// }
//  0 1 2

//=============================
// for (let i = 0; i <= 10; i++) {
//     if (i % 2 === 0)
//         console.log(i);
// }
//  0 2 4 6 8 10


//=============================
// for (let i = 0; i <= 50; i = i + 5) {
//     console.log(i);
// }
//  0 5 10 and add by 5 until 50

//=====================================


// let จำนวนรอบ = prompt('ใส่จำนวนรอบที่ต้องการ');
// let step = prompt('input step');
// for( i = 1; i <= 50 ; i++) {
//     console.log(i * step);
// }
// 5 , 10, 15 , 20  ไปเรื่อย ครบ 50 รอบ

//=====================================
let sum = 0;
for (i=1; i <=1027 ; i=i+2){
    sum += i;
}
console.log(sum); //264196